In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame(np.random.randint(40,99,20).reshape(4,5))

In [4]:
df

    0   1   2   3   4
0  66  68  88  59  56
1  45  51  63  97  40
2  74  53  90  82  86
3  81  57  60  61  74

In [5]:
df.columns

RangeIndex(start=0, stop=5, step=1)

In [6]:
columns = ['Subject1','Subject2','Subject3','Subject4','Subject5']

In [7]:
df.columns = columns

In [8]:
df

   Subject1  Subject2  Subject3  Subject4  Subject5
0        66        68        88        59        56
1        45        51        63        97        40
2        74        53        90        82        86
3        81        57        60        61        74

In [9]:
df['Total'] = df.Subject1+ df.Subject2 + df.Subject3 + df.Subject4 + df.Subject5

In [10]:
df

   Subject1  Subject2  Subject3  Subject4  Subject5  Total
0        66        68        88        59        56    337
1        45        51        63        97        40    296
2        74        53        90        82        86    385
3        81        57        60        61        74    333

In [11]:
df['Percentage'] = df.Total/500*100

In [12]:
df

   Subject1  Subject2  Subject3  Subject4  Subject5  Total  Percentage
0        66        68        88        59        56    337        67.4
1        45        51        63        97        40    296        59.2
2        74        53        90        82        86    385        77.0
3        81        57        60        61        74    333        66.6

In [13]:
df['Average'] = df.Total/5

In [14]:
df

,Subject1,Subject2,Subject3,Subject4,Subject5,Total,Percentage,Average
0,66,68,88,59,56,337,67.4,67.4
1,45,51,63,97,40,296,59.2,59.2
2,74,53,90,82,86,385,77.0,77.0
3,81,57,60,61,74,333,66.6,66.6

In [15]:
df.describe()

,Subject1,Subject2,Subject3,Subject4,Subject5,Total,Percentage,Average
count,4.000000,4.000000,4.000000,4.000000,4.00000,4.000000,4.000000,4.000000
mean,66.500000,57.250000,75.250000,74.750000,64.00000,337.750000,67.550000,67.550000
std,15.588457,7.588368,15.945219,18.117671,20.19901,36.509131,7.301826,7.301826
min,45.000000,51.000000,60.000000,59.000000,40.00000,296.000000,59.200000,59.200000
25%,60.750000,52.500000,62.250000,60.500000,52.00000,323.750000,64.750000,64.750000
50%,70.000000,55.000000,75.500000,71.500000,65.00000,335.000000,67.000000,67.000000
75%,75.750000,59.750000,88.500000,85.750000,77.00000,349.000000,69.800000,69.800000
max,81.000000,68.000000,90.000000,97.000000,86.00000,385.000000,77.000000,77.000000

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 8 columns):
Subject1      4 non-null int32
Subject2      4 non-null int32
Subject3      4 non-null int32
Subject4      4 non-null int32
Subject5      4 non-null int32
Total         4 non-null int32
Percentage    4 non-null float64
Average       4 non-null float64
dtypes: float64(2), int32(6)
memory usage: 288.0 bytes

In [20]:
type(df)

pandas.core.frame.DataFrame

AttributeError: 'DataFrame' object has no attribute 'dtype'

In [23]:
df

,Subject1,Subject2,Subject3,Subject4,Subject5,Total,Percentage,Average
0,66,68,88,59,56,337,67.4,67.4
1,45,51,63,97,40,296,59.2,59.2
2,74,53,90,82,86,385,77.0,77.0
3,81,57,60,61,74,333,66.6,66.6

In [24]:
df.loc[0]

Subject1       66.0
Subject2       68.0
Subject3       88.0
Subject4       59.0
Subject5       56.0
Total         337.0
Percentage     67.4
Average        67.4
Name: 0, dtype: float64

In [25]:
df.loc[0]

Subject1       66.0
Subject2       68.0
Subject3       88.0
Subject4       59.0
Subject5       56.0
Total         337.0
Percentage     67.4
Average        67.4
Name: 0, dtype: float64

In [26]:
df.head()

,Subject1,Subject2,Subject3,Subject4,Subject5,Total,Percentage,Average
0,66,68,88,59,56,337,67.4,67.4
1,45,51,63,97,40,296,59.2,59.2
2,74,53,90,82,86,385,77.0,77.0
3,81,57,60,61,74,333,66.6,66.6

In [27]:
df.Subject1

0    66
1    45
2    74
3    81
Name: Subject1, dtype: int32

In [28]:
df.Subject2

0    68
1    51
2    53
3    57
Name: Subject2, dtype: int32

In [29]:
df.head(2)

,Subject1,Subject2,Subject3,Subject4,Subject5,Total,Percentage,Average
0,66,68,88,59,56,337,67.4,67.4
1,45,51,63,97,40,296,59.2,59.2

In [30]:
df.Subject1

0    66
1    45
2    74
3    81
Name: Subject1, dtype: int32

In [31]:
df.head(100)

,Subject1,Subject2,Subject3,Subject4,Subject5,Total,Percentage,Average
0,66,68,88,59,56,337,67.4,67.4
1,45,51,63,97,40,296,59.2,59.2
2,74,53,90,82,86,385,77.0,77.0
3,81,57,60,61,74,333,66.6,66.6

In [32]:
df.loc[0]

Subject1       66.0
Subject2       68.0
Subject3       88.0
Subject4       59.0
Subject5       56.0
Total         337.0
Percentage     67.4
Average        67.4
Name: 0, dtype: float64

In [34]:
df[['Subject1','Subject2']]

   Subject1  Subject2
0        66        68
1        45        51
2        74        53
3        81        57

In [35]:
df.Subject1

0    66
1    45
2    74
3    81
Name: Subject1, dtype: int32

In [42]:
columns = ['Subject One','Subject2','Subject3','Subject4','Subject5','Total','Percentage','Average']

In [43]:
df.columns

Index(['Subject1', 'Subject2', 'Subject3', 'Subject4', 'Subject5', 'Total',
       'Percentage', 'Average'],
      dtype='object')

In [44]:
df.columns = columns

In [45]:
df

,Subject One,Subject2,Subject3,Subject4,Subject5,Total,Percentage,Average
0,66,68,88,59,56,337,67.4,67.4
1,45,51,63,97,40,296,59.2,59.2
2,74,53,90,82,86,385,77.0,77.0
3,81,57,60,61,74,333,66.6,66.6

In [46]:
df.Subject One

SyntaxError: invalid syntax (<ipython-input-46-0bc45ae44690>, line 1)

In [48]:
df['Subject One']

0    66
1    45
2    74
3    81
Name: Subject One, dtype: int32

In [49]:
df

,Subject One,Subject2,Subject3,Subject4,Subject5,Total,Percentage,Average
0,66,68,88,59,56,337,67.4,67.4
1,45,51,63,97,40,296,59.2,59.2
2,74,53,90,82,86,385,77.0,77.0
3,81,57,60,61,74,333,66.6,66.6

In [54]:
df['Gender'] = np.random.choice(['Male','Female'],4)

In [56]:
df

,Subject One,Subject2,Subject3,Subject4,Subject5,Total,Percentage,Average,Gender
0,66,68,88,59,56,337,67.4,67.4,Male
1,45,51,63,97,40,296,59.2,59.2,Female
2,74,53,90,82,86,385,77.0,77.0,Female
3,81,57,60,61,74,333,66.6,66.6,Male